import React from "react";
import NewsItem from "../News/NewsItem";
import food from "../../assets/food.jpg";

function NewsList() {
  return (
    <div className="grid gap-2">
      <h1 className="p-4 px-2 text-3xl font-bold border-b border-gold w-fit">
        أخبار الجمعية
      </h1>
      <NewsItem
        link="news"
        img={food}
        title={"هذا عنوان الخبر"}
        date={"10/12/2023"}
        description={`أنشئت مُنظّمة "تَنمِية" كجمعية غير ربحية في عام 2023، ويقع مكتبها الرئيسي في قرية اكسال في الجليل، وتُعنى باقامة مشاريع لدعم التنمية الاقتصادية والاجتماعية للمجتمع العربي في الداخل، خاصة في مجال التشغيل ومحاربة البطالة، ودعم تخطّي العقبات التي تواجه نموّه وصولا الى تحسين مستوى وجودة حياة أبناء مجتمعنا. المحامي أحمد فاروق دراوشة يشغل منصب المدير العام لجمعية "تنمية"، وهو حاصل على اللقب الأول في الحقوق واللقب الثاني ادارة المنظّمات.`}
        id={5}
      />
      <NewsItem
        link="news"
        img={food}
        title={"هذا عنوان الخبر"}
        date={"10/12/2023"}
        description={`أنشئت مُنظّمة "تَنمِية" كجمعية غير ربحية في عام 2023، ويقع مكتبها الرئيسي في قرية اكسال في الجليل، وتُعنى باقامة مشاريع لدعم التنمية الاقتصادية والاجتماعية للمجتمع العربي في الداخل، خاصة في مجال التشغيل ومحاربة البطالة، ودعم تخطّي العقبات التي تواجه نموّه وصولا الى تحسين مستوى وجودة حياة أبناء مجتمعنا. المحامي أحمد فاروق دراوشة يشغل منصب المدير العام لجمعية "تنمية"، وهو حاصل على اللقب الأول في الحقوق واللقب الثاني ادارة المنظّمات.`}
        id={5}
      />
      <NewsItem
        link="news"
        img={food}
        title={"هذا عنوان الخبر"}
        date={"10/12/2023"}
        description={`أنشئت مُنظّمة "تَنمِية" كجمعية غير ربحية في عام 2023، ويقع مكتبها الرئيسي في قرية اكسال في الجليل، وتُعنى باقامة مشاريع لدعم التنمية الاقتصادية والاجتماعية للمجتمع العربي في الداخل، خاصة في مجال التشغيل ومحاربة البطالة، ودعم تخطّي العقبات التي تواجه نموّه وصولا الى تحسين مستوى وجودة حياة أبناء مجتمعنا. المحامي أحمد فاروق دراوشة يشغل منصب المدير العام لجمعية "تنمية"، وهو حاصل على اللقب الأول في الحقوق واللقب الثاني ادارة المنظّمات.`}
        id={5}
      />
      <NewsItem
        link="news"
        img={food}
        title={"هذا عنوان الخبر"}
        date={"10/12/2023"}
        description={`أنشئت مُنظّمة "تَنمِية" كجمعية غير ربحية في عام 2023، ويقع مكتبها الرئيسي في قرية اكسال في الجليل، وتُعنى باقامة مشاريع لدعم التنمية الاقتصادية والاجتماعية للمجتمع العربي في الداخل، خاصة في مجال التشغيل ومحاربة البطالة، ودعم تخطّي العقبات التي تواجه نموّه وصولا الى تحسين مستوى وجودة حياة أبناء مجتمعنا. المحامي أحمد فاروق دراوشة يشغل منصب المدير العام لجمعية "تنمية"، وهو حاصل على اللقب الأول في الحقوق واللقب الثاني ادارة المنظّمات.`}
        id={5}
      />
    </div>
  );
}

export default NewsList;
