import React from "react";
import NewsItem from "../News/NewsItem";
import children from "../../assets/children.jpg";

function Programs() {
  return (
    <div className="grid gap-2">
      <h1 className="p-4 px-2 text-3xl font-bold border-b border-gold w-fit">
        المشاريع والبرامج{" "}
      </h1>
      <NewsItem
        img={children}
        title={"اسم المشروع الأول"}
        link="programs"
        description={`أنشئت مُنظّمة "تَنمِية" كجمعية غير ربحية في عام 2023، ويقع مكتبها الرئيسي في قرية اكسال في الجليل، وتُعنى باقامة مشاريع لدعم التنمية الاقتصادية والاجتماعية للمجتمع العربي في الداخل، خاصة في مجال التشغيل ومحاربة البطالة، ودعم تخطّي العقبات التي تواجه نموّه وصولا الى تحسين مستوى وجودة حياة أبناء مجتمعنا. المحامي أحمد فاروق دراوشة يشغل منصب المدير العام لجمعية "تنمية"، وهو حاصل على اللقب الأول في الحقوق واللقب الثاني ادارة المنظّمات.`}
        id={2}
      />
      <NewsItem
        img={children}
        title={"هذا عنوان الخبر"}
        link="programs"
        description={`أنشئت مُنظّمة "تَنمِية" كجمعية غير ربحية في عام 2023، ويقع مكتبها الرئيسي في قرية اكسال في الجليل، وتُعنى باقامة مشاريع لدعم التنمية الاقتصادية والاجتماعية للمجتمع العربي في الداخل، خاصة في مجال التشغيل ومحاربة البطالة، ودعم تخطّي العقبات التي تواجه نموّه وصولا الى تحسين مستوى وجودة حياة أبناء مجتمعنا. المحامي أحمد فاروق دراوشة يشغل منصب المدير العام لجمعية "تنمية"، وهو حاصل على اللقب الأول في الحقوق واللقب الثاني ادارة المنظّمات.`}
        id={5}
      />
      <NewsItem
        img={children}
        title={"هذا عنوان الخبر"}
        link="programs"
        description={`أنشئت مُنظّمة "تَنمِية" كجمعية غير ربحية في عام 2023، ويقع مكتبها الرئيسي في قرية اكسال في الجليل، وتُعنى باقامة مشاريع لدعم التنمية الاقتصادية والاجتماعية للمجتمع العربي في الداخل، خاصة في مجال التشغيل ومحاربة البطالة، ودعم تخطّي العقبات التي تواجه نموّه وصولا الى تحسين مستوى وجودة حياة أبناء مجتمعنا. المحامي أحمد فاروق دراوشة يشغل منصب المدير العام لجمعية "تنمية"، وهو حاصل على اللقب الأول في الحقوق واللقب الثاني ادارة المنظّمات.`}
        id={4}
      />
      <NewsItem
        img={children}
        title={"هذا عنوان الخبر"}
        link="programs"
        description={`أنشئت مُنظّمة "تَنمِية" كجمعية غير ربحية في عام 2023، ويقع مكتبها الرئيسي في قرية اكسال في الجليل، وتُعنى باقامة مشاريع لدعم التنمية الاقتصادية والاجتماعية للمجتمع العربي في الداخل، خاصة في مجال التشغيل ومحاربة البطالة، ودعم تخطّي العقبات التي تواجه نموّه وصولا الى تحسين مستوى وجودة حياة أبناء مجتمعنا. المحامي أحمد فاروق دراوشة يشغل منصب المدير العام لجمعية "تنمية"، وهو حاصل على اللقب الأول في الحقوق واللقب الثاني ادارة المنظّمات.`}
        id={3}
      />{" "}
    </div>
  );
}

export default Programs;
